app/controllers/users/registrations_controller.rb

SELECT "categories"."name" FROM "categories"
---
  def set_categories
    @categories = Category.all.pluck(:name)